{
  "posts":[
    {
      "id" : 0,
      "title": "First post!",
      "content" : "My first content!"
    }
  ],
  "comments" : [
    {
      "id": 0,
      "content": "Wow such content!",
      "username": "zero_cool"
    },
    {
      "id": 1,
      "content": "Wow such content!",
      "username": "zero_cool"
    }
  ],
  "heroes" : [
    {
      "id": 1,
      "name": "Vasya",
      "img": "1.jpg",
      "content": "Тестовый контент"
    },
    {
      "id": 2,
      "name": "Петя",
      "img": "1.jpg",
      "content": "Тестовый контент"
    }
  ],
  "articles" : [
      {
        "title": "Первая статья",
        "img": "http://berserk-web.ru/img/blog/1.jpg",
        "content": ""\nНаписать даже одну статью оказалось сложнее, чем разработать площадку для ее размещения. \n\nДля наших клиентов, разумеется, это хорошая новость. \n\nЗдесь будем размещать заметки, если таковые будут, и добавим портфолио (сделаем отдельный фильтр для него).\n\nА сейчас немного углубимся в \"технические\" детали, касающиеся создания этого блога и сайтов в общем. Возможно так будем делать и для нашего портфолио. Делаем это для того, чтобы клиент, заходя на сайт и задаваясь вопросом \"А сделают ли эти ребята мне сайт хорошо?\", мог получить на него ответ и познакомиться с уровнем нашей экспертности.\n<br>\n<img src=\"http://berserk-web.ru/img/blog/first/1.png\" alt=\"dzen\">\n<br>\n<h3>Каким критериям это \"хорошо\" должно отвечать?</h3>\nПервый и основной критерий для ответа на этот вопрос: должно просто нравится. Да, это странно слышать из уст технических специалистов, но со временем приходишь именно к этому. Если мы делаем что-то для людей, они заходят на наш сайт, нажимают на кнопки, читают тексты, то нужно чтобы им было при этом удобно и уютно. В этот момент не важно сколько строчек кода написано и с помощью какой супер пупер современной технологии это было сделано. Если при этом у человека что-то не загрузилось или невозможно прочитать ваш креативный шрифт, значит задача не выполнена. Поэтому нравится должно бессознательно и это должна быть тихая спокойная радость от того, что ты нашел то, что ищещь или от самого процесса взаимодействия с приложением, сайтом, человеком и бизнесом. Спокойная радость, а не чувство \"ой, действительно осталось 2 дня на эти чудесные скидки, надо быстрее купить, а то потом будет дороже, вот здесь и время в секундах в обратную сторону отсчитывается, ааа!\". Мы не отрицаем различные эффективные методы современного маркетинга, но они должны быть уместны и своевременны.\n\nДругих, отдельных критериев нет, они дальше вытекают из этого основного.\n\n<h3>На сайте не должно быть ничего лишнего</h3>\n\nКак техническим специалистам в мире современного глобального кода, нам часто приходится сидеть на сайтах передовых западных (и отечественных) разработчиков, которые задают тренды в разработке, создавая самые совершенные решения. И так вот: на этих сайтах царит совершенный дзен.\n\n<h4>For Example:</h4>\n\n<img src=\"http://berserk-web.ru/img/blog/first/2.png\" alt=\"dzen\">\n<br>\nИтак, на сайте не должно быть ничего лишнего и это здоровый критерий который приведет Вас к успеху.\n\nПричем это такой абсолютный закон: если вы не уверены что это вам надо, значит это вам не надо. Если это можно не делать, значит это делать не надо. Если вы не знаете что сделать или что добавить, значит ничего делать и добавлять не надо и так далее. Иногда лучше не сделать ничего.\n\nИз этого закона вытекает построение сайта. Еще на этапе прототипирования нужно ответить на вопрос, зачем это, что именно я хочу сказать этим, какую функцию это будет выполнять?\n\nПотому что иначе в сегодняшнем мире переполненным технологиями решение будет не выбрать. Предложений море, идей куча, и если это все одним разом вы просто засунете на свой сайт, то клиент никогда не заметит, что вы, например, производите высококачественные солнечные батареи, а это было ключевое.\n\n<h4>Epic Fail.</h4>\n\n<img src=\"http://berserk-web.ru/img/blog/first/3.jpg\">\n<br>\nБывает такое, приходит клиент, ему очень надо, чтобы сайт \"продавал\", и он волнуется и спрашивает: \"а может надо добавить вот такой звоночек сюда? А может надо чтобы всплывающее окно выскакивало и цепляло клиента? А может еще CallBackHunter? А может Квиз запилить? А может чтобы из компьютера выскакивал человек и хватал клиента, пока он не передумал?\".\n<br>\n<img src=\"http://berserk-web.ru/img/blog/first/4.png\" alt=\"ghost\">\n<br>\nНет, не нужно. Чем вы занимаетесь? Вот ключевой вопрос и не к вашему клиенту, а к вам, уважаемый заказчик.\n\nКлючевая задача сайта отразить ваш бизнес или идею максимально точно. Достоверно. И если за Идеей или бизнесом ничего не стоит, то поправлять это сайтом плохая мысль.\n\nПосле того, как вы успокоились и поняли, что вы хотите донести, уже из этого начинается прототипирование. Наброски идей и выбор наиболее понравившейся. И не усложняйте. Лучше двигаться небольшими, но точными и красивыми иттерациями: создание посадочной страницы - познакомили с ней аудиторию - обработали обратную связь - создалил еще одну - узналили потребности - сделали сайт визитку - появилась потребность и возможность предложить товар - сделали интернет магазин. И так далее.\n\n<h3>Сайт должен работать быстро</h3>\n\nНаконец-то техническая деталь думаете вы =) Но пока еще нет. Если вы внимательно прочитали предыдущий пункт, то эти вещи взаимосвязаны. Если вы не будете перегружать технологию потоками идей, то одну простую мысль можно высказать и на одной страничке html файла, который откроется в браузере со скоростью света.\n\nИ вот только если вы вознамерились создать что-то действительно высоконагруженное, то тогда можно подбирать наиболее подходящие для этого технологии.\n\nНапример, этот сайт написан на Angular 6. Это фреймворк, написанный на языке программирования TypeScript, разрабатываемый командой из компании Google. Одна из его ключевых особенностей это связка с данными без перезагрузки основной страницы. Вы можете в этом убедиться, если попереходите по вкладкам. Страница не перезагружается.\n<br>\n<img src=\"http://berserk-web.ru/img/blog/first/5.png\" alt=\"Angular\">\n<br>\nМы тоже любим скорость и лучшие решения, но во главе угла должна стоять задача. Например для заполнения контента мы написали свою CMS \"на коленке\", которая позволяет заполнять только ключевые значения.\n<br>\n<img src=\"http://berserk-web.ru/img/blog/first/6.png\" alt=\"CMS\">\n<br>\nПока что нам не требуется ничего более сложного. Но если вам потребуется заполнять сайт огромным количеством самого разнообразного контента самостоятельно или привлекать для этого менеджеров, то лучше смотреть в сторону популярных движков, таких как Joomla, Wordpress и Drupal. Хотя их уже сейчас можно насчитывать тысячи.\n\n<h3>Сайт должен быть адаптивным к разным устройствам</h3>\n\nВозможно вы уже много раз это слышали. И это относится как раз к той теме, с которой все начиналось: удобство для пользователя. С какого бы устройства не зашел человек, он должен увидеть адекватную разметку, читабельный текст. Чтобы изображения не наползали друг на друга и так далее. Это сделать не так просто как кажется, потому что стандарты разработки со временем меняются, браузеры, через которые вы наблюдаете интернет обновляются и за этими трендами надо следить. Возможно вы замечали, что иногда можно наткнуться на какой-нибудь старый сайт в сети который отображается на сегодняшний день мягко говоря странно. Это не говоря уже о том, как трансформировалось представление о дизайне сайтов.\n<br>\n<img src=\"http://berserk-web.ru/img/blog/first/7.png\" alt=\"странный сайт\">\n<br>\n<h3>Сайт \"должен\" быть продающим</h3>\n\nЭто касается больше грамотного расположения контактных данных, форм захвата, ключевых смыслов и офферов компании, которые разрабатываются исходя из рекламных потоков, которые будут на него настраиваться. Здесь не так сложна техническая составляющая, которую можно будет подобрать под конкретный случай, здесь более важны грамотные сильные специалисты, способные качественно работать с маркетинговыми потоками.\n\n<h3>Сайт никому ничего не должен =)</h3>\n\nТо, каким будет сайт или любое другое техническое решение, зависит от того, насколько грамотно над ним поработали представители бизнеса и технические специалисты. Из плодотворной совместной работы и рождаются лучшие и прекрасные решения.\n<br>\n<img src=\"http://berserk-web.ru/img/blog/first/8.jpg\" alt=\"ya\">\n\n<h3>Всем добра!</h3>\n<h3>=)</h3>\n"",
        "id": 12
      }
    ],
    "articlestest" : [
      {
        "title": "Первая статья",
        "img": "http://berserk-web.ru/img/blog/1.jpg",
        "content": "Написать даже одну статью оказалось сложнее, чем разработать площадку для ее размещения. Для наших клиентов, думается, это хорошая новость. Здесь будем размещать заметки, если таковые будут, и добавим портфолио (сделаем отдельный фильтр для него). Коротко технические моменты: 1) Блог разработан на Angular 6. 2) База данных базируется на Heroku в json формате. 3) Это все Open Source 4) Это работает быстро, без перезагрузки страницы. 5) Это все адаптивно 6) Мы можем сделать Вам так же и даже лучше.",
        "id": 12
      }
    ]
}
